{
    "homePage": {
        "cover": "5849f85d-d88c-4047-9422-59684309f9a5",
        "coverMobile": "89ea4c50-1a5d-4e75-84ab-a5f4a3b8a214",
        "citizenshipImage": "f923b682-d048-4b4a-9aa4-6b743aa7c414",
        "homeTitle": "Your Property Expert in <span>Turkey</span>",
        "mostPopulerPropertyTitle": "Most Popular Property Type in Turkey",
        "bestCitiesToBuyTitle": "Best Cities to Buy Property in Turkey",
        "bestCitiesDesc": "If you are looking for a property as you dreamed, then you are in the right place! We provide the finest property options and guarantee to offer the best prices, so that you can enjoy the lifestyle you desire in your new home.",
        "hapyClientTitle": "More Than +3256 Client",
        "hapyClientDesc": "Because we see you as our family member, your happiness is important for us!",
        "propertyServicesTitle": "Property Services Of Istanbul Property",
        "propertyServicesDesc": "<p class=\"text mobileText\">While investing in a foreign country, the most important thing is to find a trustable consultancy.</p>",
        "discoveryTitle": "Learn More About The Property Market",
        "discoveryDesc": "<p class=\"text mobileText\">According to the updated official laws stated by the Turkish Government in relevance to obtain Turkish Citizenship procedures, the requirements are facilitated, as you only need to purchase one or more properties</p>",
        "blogTitle": "Blog",
        "realtyGroupTvTitle": "Istanbul Property Tv",
        "citizenshipTitle": "Istanbul Property’s Investment Plans For Citizenship",
        "citizenshipDesc": "<p>As per the recently updated official regulations, with the aim of facilitating Turkish Citizenship acquirement, you only need to purchase real estate with a total minimum value of $400,000.</p>\n<p>Istanbul Property guarantees a flawless Citizenship issuance procedure that comes with the following advantages:</p>\n<ul>\n<li>Visa-free. travels to more than 116 countries for personal, and more than 155 for business passports Besides the potentiality of including EU countries in the near future.</li>\n<li>Owning such a prestigious passport provides the safety of guaranteed investment returns. &bull; Quick Citizenship and passport issuance process, down to 3 months only.</li>\n<li>Multi-nationally and Wealth disclosure-free authorizations.</li>\n<li>Comprehensive Medical Insurance and quality education for the whole family.</li>\n<li>Pension system benefits.</li>\n<li>Safety, democracy, and free life privileges of this Middle Eastern- European country.</li>\n</ul>",
        "propertyPriceTurkey": "<aside>\n<div>\n<h2>Istanbul Property: Your Real Estate Company and Expert&nbsp;&nbsp;</h2>\n<p>Founded in 2009, Istanbul Property is a market leader real estate agency based in Turkey. With a team of highly qualified experts, Istanbul Property is offering a wide range of services including property selling, online sale, online consultancy, presentations and field visits, after-sale, and legal services. Trusted by numerous clients, Istanbul Property guarantees 100% client satisfaction and is committed to providing professional services that exceed your expectations for more than 13 years. Istanbul Property also aspires to make Turkey the number one real estate destination for buyers and investors from around the world, with the help of positive referrals from loyal clients. Istanbul Property, Turkey&rsquo;s safest real estate company, sells many houses per year. Real estate can be bought with Istanbul Property as it offers a reliable, stress-free, and easy experience for its clients.</p>\n<h2>What to Know Before Buying Real Estate in Turkey?</h2>\n<p>Buying real estate in Turkey comes with a list of things to know before taking action. The details of things to know before buying real estate in Turkey are explained below.</p>\n<ul>\n<li>Understanding property rights in Turkey: Knowing property rights before buying property in Turkey is important from the start. Nationalities of 183 countries and corporations have a right to buy and own immovable property in Turkey. Immovable property can be purchased as land or as separate pieces of real estate, such as offices, apartments, and shops, which are subject to condominium rights (&ldquo;kat mulkiyeti&rdquo; in Turkish). An official transfer deed written by a title deed officer and registered with the title deed office is required for the acquisition of title to real property. Individuals must be nationals of one of the nations on the white list. For more information, foreigners interested in purchasing real estate in Turkey can contact Istanbul Property, Turkish embassies, and consulates, as well as the General Directorate of Land Registry and title deed offices.</li>\n<li>Ways to obtain Turkish Citizenship: Buying real estate in Turkey comes with benefits such as obtaining <a title=\"\" href=\"https://istanbulproperty.com/turkish-citizenship\" target=\"_blank\" rel=\"noopener\">Turkish citizenship</a>. For example, buying a property worth at least $400,000 grants Turkish citizenship.</li>\n<li>Know the property buying process: Knowing the process of buying property in Turkey will create a clear image in your head when identifying your needs for real estate. The buying process is simple in Turkey. Some of the important things to consider while buying property are real estate type and location, investment returns, project options, and additional costs in the process.</li>\n<li>Choose a trustworthy real estate agent: Working with the right real estate agent is vital before buying real estate in Turkey. A reliable agent must understand your requirements, offer a wide range of projects, and provide high-quality services to make the process hassle-free.</li>\n</ul>\n<h3>What are the Features of Real Estate in Turkey?</h3>\n<p>Real estate features are a set of details that identify the property. In Turkey, real estate features can be divided into two sections. These are residential complexes and commercial real estate. A residential complex is a building or a group of buildings containing living units, providing shared spaces, social facilities, and services to its residents. Additionally, <a title=\"\" href=\"https://istanbulproperty.com/property/commercial\" target=\"_blank\" rel=\"noopener\">commercial property for sale in Turkey</a> can be named shopping malls, offices, industrial properties, and manufacturing facilities. Commercial properties provide great investment opportunities and rental incomes apart from operating a business.</p>\n<h3>What are the Real Estate Types in Turkey?</h3>\n<p>Real estate types in Turkey are identified as apartments, residences, villas, and offices. Knowing the types of real estate will assist you in selecting the ideal property for your budget and needs. <a title=\"\" href=\"https://istanbulproperty.com/property\" target=\"_blank\" rel=\"noopener\">Real estate in Turkey</a>, especially in locations like Istanbul, Antalya, and Alanya comes with numerous features aimed to maximize buyer satisfaction. Apartments are situated in multi-story buildings and skyscrapers. While regular apartments have from two rooms to six rooms, studio apartments only have one room. Luxury apartments are classified as duplexes, triplexes, and penthouses. A duplex combines two apartments on top of each other, connected by a staircase. A triplex is similar to a duplex with an additional floor on top of it. Penthouse apartments are commonly located on higher floors of a building that provide panoramic views of the surroundings. Residences are multi-story structures that feature modern-style homes with reception and security available 24/7. Residences are built for the comfort of a hotel, offering valet, housekeeping, fitness, and car wash services. A villa is a one-level, two-story, or three-story structure, often with a garden and swimming pool. Villas may share walls but they are separate units that are considered independent housing. In Turkey, offices can be found in commercial units or skyscrapers. Modern and luxurious offices are located in the heart of cities as they are surrounded by main transportation hubs, hospitals, malls, and education centers.</p>\n<h3>What are Real Estate Prices in Turkey?</h3>\n<p>The real estate market in Turkey is experiencing dynamic growth day by day. The rising demand for real estate, which is being fueled by the increasing number of construction developments, creates world-class quality standards. According to the statistics provided by the Central Bank of the Republic of Turkey, the housing index in Turkey grew to 165.50 points in March from 161.70 points in February of 2021. While the prices of property sales have climbed by 31.68% in 2020, the average size of properties is around 130 m2 and the average m2 price is $1,920. Real estate prices in Turkey vary depending on the property type, features, and location. Apartment prices range between $130,000 and $1.000.000 or more. The average price of a property is $300,000 in Istanbul, Turkey, $300,000 in Antalya, and $150,000 in Alanya. Villa prices start from $600,000 and go up to $5.000.000. The average price of a villa real estate in Bodrum, Turkey is $600,000. On the other hand, commercial units such as offices cost between $300.000 and $3,345,000. The real estate prices in Turkey are determined according to the following factors.</p>\n<ul>\n<li>Location: Real estate location is the top reason that determines the price. The more upscale the location, the higher the price. A location near public transportation is likely to be more expensive than one in a remote location.</li>\n<li>Real estate size and features: The size and the features of the real estate and the facilities offered in the complex are important details that determine the price of real estate.</li>\n<li>Real estate view: Another important factor that affects the real estate price in Turkey is the view of the property. While a property with a sea view is the most valuable, other views such as the green landscape or panoramic city have a significant impact on pricing.</li>\n</ul>\n<h3>How Much Are Property Taxes in Turkey?</h3>\n<p>Property tax is a type of tax imposed on property owned by an individual or a corporation. Property tax is set by the local government in the area where the property is located and the property owner is responsible for paying it. In Turkey, property tax is 2% and must be paid by both the buyer and the seller when the property is sold. These fees (which amount to 4% of the purchase price) are based on a property evaluation report prepared by a real estate appraiser. The evaluation report declares the property value and is only valid for three months. The report should be delivered to the title deed office. The property&rsquo;s claimed worth cannot be lower than the tax value, which is also used as the base for the local property tax. There is a 0.948% stamp duty of the value stated on the sale agreement. If the apartment in Turkey is less than 150 square meters, the VAT rate is 1%. Apartments classified as luxurious in metropolitan areas are expected to pay 8% or 18% VAT. Apartments located within a metropolitan area must pay 0.2% in annual property taxes. Properties located outside of a metropolitan area are subject to a 0.1% tax. For commercial properties, the annual real estate tax is 0.4% in big cities and 0.2% in small cities. The first and second installments of local property tax are payable in May and November. You can contact your local municipality for more information and payment alternatives.</p>\n<h3>How Much Property is Bought Every Year from Turkey?</h3>\n<p>Buying property in Turkey several factors affect the number of property sales in Turkey each year. It is expected that changing conditions will have varied results over time. The economic position in Turkey, the turbulence in stock and global markets, as well as the pandemic, are all important issues to address. According to the Turkish Statistics Institute, 50,735 houses were sold in total to foreigners in 2021. Istanbul is ranked first with 23,169 real estate sales to foreigners in 2021. Istanbul was followed by Antalya with 10,557 sales, Ankara with 3,183 sales, Mersin with 2,213 sales, Bursa with 1,435 sales, Izmir with 1,171 sales, and Sakarya with 1,062 sales.</p>\n</div>\n<div>\n<h2>How to Buy Real Estate in Turkey?</h2>\n<p>Buying real estate in another country is a significant lifestyle and investment decision and luckily, it is relatively a simple process in Turkey. Below, you can find the detailed steps for buying a real estate investment in Turkey.</p>\n<ul>\n<li>Conduct research: The Turkish real estate market is expanding rapidly. Start the buying process by performing thorough research. There are numerous residential and commercial units for sale in multiple locations in Turkey.</li>\n<li>Find a trustworthy real estate agent: Before beginning the buying process, it is critical to choose a reputable real estate agent. Agents with a long background in the market are more likely to be trustworthy. The agent you work with must have the required experience and skills to meet your demands. Even though there are other real estate firms, when it comes to real estate investment with the help of a reputable and trustworthy agent, real estate can be bought with Istanbul Property safely and easily.</li>\n<li>Travel to Turkey: Taking a trip to Turkey to check the properties is a good idea. Before buying real estate, you should learn about the location, understand the neighborhoods, and know the surrounding areas. You should look into every alternative as much as possible.</li>\n<li>Negotiate the purchase price and terms: You can negotiate the price and terms of a property, then reserve and freeze the price. You can get legal assistance from a lawyer at any time during this procedure.</li>\n<li>Payment stage: Several Turkish banks provide mortgages to foreigners interested in buying real estate in Turkey. Appoint a solicitor to complete the transaction using a power of attorney.</li>\n<li>Obtain your Turkish title deed (TAPU): The final step is to receive your Turkish TAPU. Once all of the paperwork and contractual requirements on both sides have been fulfilled, the real estate will be registered on your behalf and you will receive the title deed (TAPU) for your new property in Turkey.</li>\n</ul>\n<p>Foreigners interested in purchasing real estate in Turkey should be aware of the following conditions:</p>\n<ul>\n<li>Foreign nationals can only purchase a total of 30 hectares of land in Turkey, with only limited rights.</li>\n<li>In military-restricted zones and security zones, foreigners are prohibited from purchasing or renting property.</li>\n<li>Foreign nationals may acquire property or a limited right in a district/town up to 10% of the total area of the district/town.</li>\n</ul>\n<h3>What are the Conditions for Buying Real Estate in Turkey?</h3>\n<p>Foreigners are allowed to buy land and real estate in Turkey in their names as long as the properties are in cities and towns. Real estate in villages or rural areas and military zones are exempt. To get the property&rsquo;s title, an application must be presented to the local Land Registry Office where the property is located. The Land Registry Office transfers the title after conducting the appropriate searches and verification for the requirements mentioned above. The paperwork related to the transfer of the total purchase price in Turkey must be given to the Land Registry Office. During the transaction, a 2% real estate tax (title deed fee) is owed and collected from both the buyer and the seller. For the first five years, newly constructed properties are exempt from paying annual property taxes. For tax purposes, all real estates are subject to reappraisal every five years. The real estate can be resold or rented out, with the revenues being moved out of Turkey. When real estate is purchased for business purposes, different rules apply. Article 35 of the Turkish Constitution defines ownership. This article states that everyone has the right to own anything and these rights can only be limited by other legal restrictions. These may include zoning schemes, limits on foreigners, and other restrictions. Article 633 of the Turkish Civil Code lays out the rules of ownership. This mostly clarifies the process of acquiring ownership. The registration of the land is very crucial when a foreign individual buys real estate. In Turkey, the Land Registry Department has regional directorates that are subdivided into province or district offices and are all under governmental administration. In general, foreigners are not subject to any legal restrictions when it comes to property ownership. The Village Act, as well as the Military Prohibited and Security Areas, play an essential role; Article 87 of the Village Act forbids foreigners the right to acquire property outside of a village&rsquo;s center if the cadastral division has not yet been completed or if it belongs to the Ministry of Forest. Furthermore, the statute regulating Military Prohibited and Security Locations might be a barrier, limiting foreigners&rsquo; ability to buy real estate within a certain distance of military stations or strategically vital areas.</p>\n<h3>When to Buy Real Estate in Turkey?</h3>\n<p>Whether you are buying property for investment, operating a business, or a house to live in, it&rsquo;s best to know the best times to buy real estate in Turkey. Although there is no specific answer to this question since it varies depending on the city, location, and property type, knowing the key points will be helpful for the buying process. Spring is the top season when the real estate market is busy. March, April, and May are usually the best months to do renovation in the house and move in. Spring is the ideal time to buy real estate in Turkey, even though the prices may rise due to competition. For more affordable property options, winter is the best season to buy real estate in Turkey since house sales are quite low, meaning cheaper prices for real estate. The end of the year is usually a good time to research residential and commercial projects and buy real estate in Turkey, as many construction companies announce advantageous campaigns during this time of the year. The economic conditions and fluctuation in the foreign exchange markets of Turkey directly impact the real estate market. It&rsquo;s best to follow economic trends by the changes in real estate prices. Regions that are under construction developments are worth following for investment purposes. For instance, if a public transportation hub is being constructed nearby the property, then the price of real estate in that region is likely to rise in the future. Knowing the area and its projects well and following the developments up close could end up as a smart investment. Another good time to buy real estate in Turkey is when mortgage rates are low. You can compare loans with various banks and choose the one that works best for your budget.</p>\n<h3>Where is the Best Place to Buy Property in Turkey?</h3>\n<p>Knowing the popular locations before buying property in Turkey can be helpful before deciding where to buy real estate. Here is a list of all the best places to buy property in Turkey.</p>\n<ul>\n<li>Istanbul: <a title=\"\" href=\"https://istanbulproperty.com/property/istanbul\" target=\"_blank\" rel=\"noopener\">Property in Istanbul</a> creates the most popular and attractive real estate market in Turkey. From residences and villas to commercial units, <a title=\"\" href=\"https://istanbulproperty.com/property/apartment\" target=\"_blank\" rel=\"noopener\">Istanbul apartments</a> offer a wide range of property options.</li>\n<li>Bursa: Bursa, located close to Istanbul, has great opportunities for those who want to buy<a title=\"\" href=\"https://istanbulproperty.com/property/bursa\" target=\"_blank\" rel=\"noopener\">&nbsp;cheap apartments in Bursa</a>.</li>\n<li>Antalya: <a title=\"\" href=\"https://istanbulproperty.com/property/antalya\" target=\"_blank\" rel=\"noopener\">Real estate in Antalya</a> is foreigners&rsquo; top choice in Turkey when it comes to holiday homes.</li>\n<li>Alanya: Following Antalya, <a title=\"\" href=\"https://istanbulproperty.com/property/alanya\" target=\"_blank\" rel=\"noopener\">Alanya real estate</a> has numerous options for those looking for an excellent holiday destination.</li>\n<li>Izmir: <a title=\"\" href=\"https://istanbulproperty.com/property/izmir\" target=\"_blank\" rel=\"noopener\">Izmir real estate</a> is another great location to buy properties since it offers everything you need from a major city and a vacation spot in one place.</li>\n<li>Bodrum: Bodrum is home to gorgeous <a title=\"\" href=\"https://istanbulproperty.com/property/villa/bodrum\" target=\"_blank\" rel=\"noopener\">villas in Turkey</a>, attracting foreigners who are looking for style, luxury, and a sophisticated atmosphere from a property.</li>\n<li>Sakarya: Being close to the Black Sea and Istanbul, real estate in Sakarya; is a good alternative to experience a lifestyle in nature.</li>\n<li>Mersin: <a title=\"\" href=\"https://istanbulproperty.com/property/mersin\" target=\"_blank\" rel=\"noopener\">Mersin real estate </a>is inexpensive with the perfect combination of warm weather year-round in the south of Turkey.</li>\n</ul>\n<h3>Who can Buy Real Estate in Turkey?</h3>\n<p>Foreigners can buy real estate in Turkey which applies to almost every nationality in the world. Foreigners from North Korea, Cuba, Nigeria, Syria, and Armenia are the only countries that are prohibited from buying property in Turkey. Certain restrictions apply to citizens of Jordan, Israel, Fiji, and East Timor for buying real estate in Turkey.</p>\n<p>Foreigners from Russia and Ukraine are excluded from buying property along the Black Sea coast in Turkey. Greek citizens can&rsquo;t buy real estate on Turkey&rsquo;s Black Sea coast and in some Aegean provinces. A few regulations apply to the type of property for citizens from 31 countries. Moroccans, Latvians, and Egyptians, for example, are unable to purchase agricultural land in Turkey. Afghan citizens are unable to own agricultural land in Turkey and must seek a permit to buy other types of real estate. Albanian nationals can only buy office and residential property in Turkey.</p>\n<p>Foreigners who buy a property worth at least $400.000 in Turkey have a right to obtain Turkish citizenship and can use the benefits of owning a Turkish passport around the globe. Foreigners can become Turkish citizens in six months.</p>\n<h2>What are the Advantages of Buying Real Estate in Turkey?</h2>\n<p>The real estate market in Turkey is rapidly growing. Foreigners from various countries are continuing the trend of buying real estate in Turkey and joining other investors, businessmen, working professionals, and families who are happy and satisfied property owners in Turkey. The advantages of buying real estate in Turkey are listed below.</p>\n<ul>\n<li>Turkish Residency and Citizenship: Any foreigner who buys a property for $400.000 in Turkey is eligible to apply for Turkish citizenship and acquire a passport that can be used anywhere in the world. Foreigners can become Turkish citizens in six months. Residency permits will be granted to foreigners once they buy a property in Turkey, with their spouses and children under the age of 18.</li>\n<li>Cost of Living: Turkey&rsquo;s living costs are significantly cheaper than European countries. In comparison to other countries, electricity and gas bills, taxes, groceries, maintenance fees, and transportation costs are quite low. With the addition of currency exchange advantage, foreigners can enjoy a low cost of living in Turkey.</li>\n<li>Value for Money: It is common knowledge that buying a home in Europe is expensive. Turkey offers the greatest standard of life a residential complex can offer, as well as a wide range of homes at the most affordable costs.</li>\n<li>Low Property Taxes: Turkey is becoming more accessible to foreigners who want to buy real estate in the country as the tax regulations become by international norms. Because tax rates are calculated based on the value of the property, buying real estate in Turkey will result in affordable tax payments.&nbsp;</li>\n<li>High Return on Profit: Buying a property in Turkey is a wise investment. With a well-developed real estate market and potential developments all around the country, Turkey is one of the best and safest countries for long-term investment. Every year, real estate prices rise, allowing the owner to resell the property for a high profit. Furthermore, a high rental return is an additional source of income for the owner.</li>\n<li>Turkey&rsquo;s Location: The country is surrounded by the Mediterranean Sea, the Aegean Sea, the Black Sea, and the Marmara Sea, with a coastline of 8,000 kilometers. Turkey is not only great for buying sea view apartments but also the stunning natural landscape and historical background make every location in Turkey interesting to buy a property.</li>\n<li>Climate: You can expect lots of sunshine in every part of the country. The Mediterranean climate can be found in the south of Turkey where the temperature is 30&deg;C in the summer, but it hardly drops below 9&deg;C in the winter and snow is rare.</li>\n</ul>\n</div>\n</aside>",
        "metaDesc": "Istanbul Property, Turkish real estate agents. Property Turkey, Homes for Sale, Apartment residences, houses and Properties For Sale.",
        "metaTitle": "Istanbul Property - Real Estate Turkey"
    },
    "videos": [
        {
            "name": "How to Buy an Office in Turkey? Investment in Commercial Offices",
            "link": "https://www.youtube.com/watch?v=mkhS_kN1WzQ&t=18s",
            "thumbnail": "39d2236c-6785-4714-bf16-20a38ca093dc"
        },
        {
            "name": "What Are The Things To Know Before Moving To Turkey?",
            "link": "https://www.youtube.com/watch?v=yKNeU0FHpko&t=2s",
            "thumbnail": "6fdbf736-315e-4e35-b414-4ffe09f93816"
        },
        {
            "name": "What to Do After Buying a House in Turkey?",
            "link": "https://www.youtube.com/watch?v=DKF5O_aEC6c",
            "thumbnail": "ae870f13-71a5-4a84-ae85-f794ff0ad706"
        }
    ],
    "happyClients": [
        {
            "title": "Mehdi Kamuran",
            "content": "<p>I choose to obtain Turkish Citizenship by buying a property in Turkey. I now own the property I desire, and will get citizenship soon.</p>",
            "area": "Doctor, Iran",
            "cover": "07a587a9-1fd5-4acc-9f92-6a10ff6a947b"
        },
        {
            "title": "Ahmed Nasir",
            "content": "<p>I was staying in America with my family and then decided to settle in Turkey. I contacted the company which helped me in selecting the right property investment.</p>",
            "area": "Accountant, Jordan",
            "cover": "4558dd7e-2cb6-4c5d-a623-e0c5121c4e81"
        },
        {
            "title": "Jamshid Aras",
            "content": "<p>Being a Turkish Citizen was a dream of mine , this dream is achieved now, after purchasing a property for $400,000, thanks to the experience of the consultant who accompanied us during the selection process.</p>",
            "area": "Lawyer, Iran",
            "cover": "18542371-403c-4c4b-bc95-a9352133a6fc"
        },
        {
            "title": "Adam Najeeb",
            "content": "<p>I got to know the company through an online advertisement, I contacted them, and they were in contact with me the whole time. During my last visit to Turkey, I bought a property in the center of Istanbul, through the advice of your real estate expert.&nbsp;</p>",
            "area": "Engineer, Saudi Arabia",
            "cover": "06ea26b1-88a8-4e38-81bd-63657cceb1eb"
        },
        {
            "title": "Saeid Murjan",
            "content": "<p>It was a precious moment when I received my new home's title deed, all the credit goes to your company's people who assisted me during this entire journey.&nbsp;</p>",
            "area": "Businessman, Qatar",
            "cover": "ff5a2b44-3d90-4d96-8558-f4db87bf9608"
        },
        {
            "title": "Abdelqader Sadiq",
            "content": "<p>My family choose to live in Istanbul, Istanbul Property helped us find an apartment suitable for us. Everything was so easy.</p>",
            "area": "College Professor, Kuwait",
            "cover": "a12c6e2d-1d51-460f-aa1e-827e64586146"
        },
        {
            "title": "Yunus Sabri",
            "content": "<p>I purchased 3 properties through Istanbul Property, and the prices were very competitive. Life with Istanbul Property seems like the best in Turkey.</p>",
            "area": "Engineer, Lebanon",
            "cover": "0cd706fa-1e1b-4f78-93f1-b0deb0a37681"
        },
        {
            "title": "Hassan Navıd",
            "content": "<p>Buying a property in Turkey seems difficult, but through Istanbul Property's suggestions, I was able to get the best option I could possibly imagine,</p>",
            "area": "accountant, Iran",
            "cover": "d7012842-e811-43e0-a5bb-8e03370fc3d4"
        },
        {
            "title": "Malika Muhsin",
            "content": "<p>My husband and I decided to move to Turkey and start a new life, now we can live a stable life. Istanbul Property solved all our problems and offered us options that we could not find elsewhere.</p>",
            "area": "Dentist, Jordan",
            "cover": "249c54c3-52f4-4169-b228-bd0a7cce30a4"
        },
        {
            "title": "Muhamed Farhad",
            "content": "<p>I am so grateful that I was able to buy an apartment and a shop in the center of Istanbul at a fantastic price. I have to thank Istanbul Property&rsquo;s team, their service is excellent and satisfactory.&nbsp;</p>",
            "area": "Businessman, Iran",
            "cover": "81ba893d-8971-492a-9943-1dd931028d48"
        },
        {
            "title": "Hussain Ali",
            "content": "<p>I bought a house in Turkey with the assistance of Istanbul Property and the experience was really special.</p>",
            "area": "Doctor, Iran",
            "cover": "2fdaf98a-14a9-4fb7-a5b1-838e64d715f7"
        },
        {
            "title": "Orkhan Mirziyoyev",
            "content": "<p>I wish you all the success in every step of your professional path. A company worthy of respect, and distinguished staff.</p>",
            "area": "Contractor, Uzbekistan",
            "cover": "4448d2b9-2456-43ca-93de-f4461e87ee55"
        },
        {
            "title": "Hassan Omran",
            "content": "<p>I've always loved Turkey and dreamed about living in it. I decided to leave everything in my home country and settle here with my family. Thanks for all your help.</p>",
            "area": "Office manager, Algeria",
            "cover": "84b48f5b-f695-456b-a69e-71f02635a590"
        },
        {
            "title": "Abd Alhaq Mansoory",
            "content": "<p>I filled out the contact request and received a recommendation to come to Turkey. I arrived here to visit the proposed projects and purchased the suitable property. &nbsp;Everything was so easy! Now I have my own home in Turkey, thanks to Istanbul Property.&nbsp;</p>",
            "area": "Trader, Bahrain",
            "cover": "a1337948-d24c-4a81-a436-9bbc1f530e1d"
        },
        {
            "title": "Ali Jasim",
            "content": "<p>Everyone is looking for stability, so I decided to move to Turkey, and buy a property there,&nbsp; to become a citizen, which seemed the best choice for me and my wife. This is the way I may have full freedom to conduct my business here in Turkey. I completely trust Istanbul Property to help me with achieving this goal.</p>",
            "area": "Optician, Iraq",
            "cover": "449a7f4a-eb68-499e-b5bc-a5a6f15ecaa5"
        },
        {
            "title": "Rasheda Shukrey",
            "content": "<p>I came here from Algeria to secure my children&rsquo;s future. Everything here was simple and this helped in choosing our new apartment with the assistance of Istanbul Property.</p>",
            "area": "Biotechnologist, Algeria",
            "cover": "921a15ef-1a1a-4b09-8df0-01568d8eba0c"
        },
        {
            "title": "Abdelal Tawfeeq",
            "content": "<p>I decided to move to Turkey to settle in with my family. I searched for the best company to help me while buying a house in Istanbul, and I found Istanbul Property. My family is very happy now, thank you!</p>",
            "area": "Businessman, Egypt",
            "cover": "1db6b3a0-f850-4043-a54b-0605eabc7497"
        },
        {
            "title": "Yunus Mahmood",
            "content": "<p>I had a real desire to invest in Turkey, so I asked Istanbul Property to provide me with an investment plan which was so helpful in achieving my goals of securing guaranteed monthly returns.</p>",
            "area": "Architect, Egypt",
            "cover": "ac25046a-1b62-45c4-898c-f45fe7c6d51e"
        },
        {
            "title": "Amina Masud",
            "content": "<p>I decided to buy a property in Turkey, I contacted your company and everything was excellent, your team supported me until I made the purchase. I advise everyone to do business with Istanbul Property.</p>",
            "area": "Lawyer, Algeria",
            "cover": "58c7c569-c4e2-4376-9eb8-e71255e9ad11"
        },
        {
            "title": "Munaf Saad",
            "content": "<p>I was happy to interact with Istanbul Property, they have provided me with the right options, which was a service that I did not find in other companies.&nbsp;</p>",
            "area": "Technical expert, Bahrain",
            "cover": "a88c6127-a823-44d7-b9f5-b0a8b90b2333"
        },
        {
            "title": "Jamal Shareef",
            "content": "<p>It was a great experience working with a team that respects customer choices. it&rsquo;s a prestigious company.</p>",
            "area": "Senior Supervisor, Egypt",
            "cover": "29e54350-17f2-4b0e-8c2d-5a95f379b0ef"
        },
        {
            "title": "Shadı Saab",
            "content": "<p>After filling out the contact form, a real estate expert from Istanbul Property got in touch with me and advised me to visit Turkey to take a look at suitable projects. I accepted his advice and purchased the proper real estate afterward. The process was so smooth, and I am happy to own my new house in Turkey. Thank you Istanbul Property</p>",
            "area": "Accountant, Lebanon",
            "cover": "ef7df5a4-8818-462f-89d0-3de06222bd2c"
        },
        {
            "title": "Azim Bakikhanov",
            "content": "<p>I recently received my Turkish citizenship. Thanks to Istanbul Property for choosing the right citizenship investment plan for me. Istanbul Property made my dream come true easily.</p>",
            "area": "Social Advisor, Azerbaijan",
            "cover": "3f63bd37-3cf7-4e28-83eb-72e977174a82"
        },
        {
            "title": "Mahmood Selim",
            "content": "<p>I visit Turkey for business two or three times every year. This time I saw an excellent presentation by Istanbul Property, I liked it very much, communicated with them, and bought a house in Bursa.</p>",
            "area": "Physiotherapist, Saudi Arabia",
            "cover": "25891107-5fa8-47f2-a1ce-687fd56881b2"
        },
        {
            "title": "Abdelal Razi",
            "content": "<p>I decided to move to Turkey with my family. I looked for the best Real estate company to buy a house in Istanbul. I found Istanbul Property and purchased our new house. My family is very happy now! Thanks a lot.</p>",
            "area": "Businessman,kuwait",
            "cover": "51933030-39ed-441f-8554-7bece044f685"
        },
        {
            "title": "Hussain Ibrahim",
            "content": "<p>Your ultimate dreams can be achieved by this company. Guaranteed projects and distinctive Sea view properties. Fancy towers with quality works and designs. Thank you Istanbul Property team.</p>",
            "area": "Engineer, Iran",
            "cover": "5e61ebaf-7e6e-4110-85c8-8c3ab31e8c77"
        },
        {
            "title": "Omar Fahmi",
            "content": "<p>I bought a house here in Turkey with Istanbul Property. Real estate prices in Turkey are better than in Europe and America. I was looking for something to live in, as well as an investment opportunity to make periodic profits. Thanks to Istanbul Property.</p>",
            "area": "Banking Broker, Algeria",
            "cover": "01a8fee9-129f-4b36-a0d3-b350cc5e761e"
        },
        {
            "title": "Hazim Khaleel",
            "content": "<p>Most people are afraid of dealing with real estate companies because of the high percentage of fraud and scamming incidents. However, here in Istanbul Property, you can find full credibility and honesty. You wont even hesitate to ask whatever you want.&nbsp;</p>",
            "area": "Construction supervisor, Jordan",
            "cover": "f81ef04c-7fc5-4eb4-a58a-9dcca79ddc14"
        },
        {
            "title": "Hamied Behzad",
            "content": "<p>A qualified professional team. Their level of experience was evident while dealing with customers and choosing the best for them. This is done through contracting with the best Turkish construction companies, and you can't see this in other small real estate firms.&nbsp;</p>",
            "area": "Dentist, Iran",
            "cover": "877283b5-f722-4b17-8644-7689e2140c59"
        },
        {
            "title": "Erlan Brat",
            "content": "<p>The best company I have ever dealt with during my journey to find the most suitable property. Full services and continuous support even after buying the property.</p>",
            "area": "Therapist, Bosnia and Herzegovina",
            "cover": "170a4d4f-68ac-4868-a63d-f48ba3c58707"
        },
        {
            "title": "Rami Haddad",
            "content": "<p>The apartment was reserved, then the title deed was received, and the investment started in Turkey with Istanbul Property.</p>",
            "area": "Retail business owner, Lebanon",
            "cover": "2c2bfb03-7997-4d73-b1fe-b9f2034281af"
        },
        {
            "title": "Timur Smirnov",
            "content": "<p>My dream came true with Istanbul Property.</p>",
            "area": "Engineer, Russia",
            "cover": "1a99dcb4-6a81-4bce-8194-9576a1b3fd6b"
        },
        {
            "title": "Daria Mirza",
            "content": "<p>I came to Turkey for a summer vacation and fell in love with the country. I came across an attractive property advertisement made by Istanbul Property. Requested their services, and now I am living in my new home in Istanbul.&nbsp;</p>",
            "area": "Cosmetic Specialist, Iran",
            "cover": "b0b9b4c4-71da-4091-b997-48ca049bafe1"
        }
    ],
    "pages": [
        {
            "title": "Online Consultancy",
            "shortDesc": "<p>With our top-rated multilingual real estate professional experts, Istanbul Property is here to help you make the right decision regarding buying, selling, or investing in real estate in Turkey, through a specialist team.</p>",
            "cover": "3a5ad19a-3c32-44ee-b9b9-24427cf25c8e",
            "slug": "online-consultancy"
        },
        {
            "title": "Property Management",
            "shortDesc": "<p>Istanbul Property profoundly cares about you and your property investments as you are investing in a foreign country. Whether it's supporting you in rental investments, re-selling, selecting furniture, and much more. You can relax and let us take care of the rest.</p>",
            "cover": "3887598d-980e-4c96-9379-e45698dba674",
            "slug": "property-management"
        },
        {
            "title": "After Sale Service",
            "shortDesc": "<p>Because we care about you, our responsibilities will not stop after finalizing the property purchase. Our Professional department specializing in After-Sale services will continue to assist you in securing a successful real estate investment</p>",
            "cover": "d161e98b-2b3a-4209-a073-09501f43510c",
            "slug": "after-sale-service"
        },
        {
            "title": "Legal Services",
            "shortDesc": "<p>We are here to keep you safe with our dedicated Legal Department, which includes a team of professional Turkish lawyers with extensive experience handling all aspects of real estate transactions and citizenship.</p>",
            "cover": "ef037f42-aeb6-4197-bbb4-27cd8b977448",
            "slug": "legal-services"
        }
    ],
    "propertyTypeByCount": [
        {
            "propertyTypeId": 1,
            "propertyTypeName": "Apartment",
            "slug": "apartment",
            "sonucAdet": 438
        },
        {
            "propertyTypeId": 4,
            "propertyTypeName": "Commercial",
            "slug": "commercial",
            "sonucAdet": 170
        },
        {
            "propertyTypeId": 5,
            "propertyTypeName": "Offices",
            "slug": "offices",
            "sonucAdet": 88
        },
        {
            "propertyTypeId": 3,
            "propertyTypeName": "Residence",
            "slug": "residence",
            "sonucAdet": 272
        },
        {
            "propertyTypeId": 2,
            "propertyTypeName": "Villa",
            "slug": "villa",
            "sonucAdet": 82
        }
    ],
    "propertyCategoryByCount": [
        {
            "propertyTypeId": 8,
            "propertyTypeName": "Investment",
            "slug": "investment",
            "sonucAdet": 186
        },
        {
            "propertyTypeId": 9,
            "propertyTypeName": "Luxury",
            "slug": "luxury",
            "sonucAdet": 207
        },
        {
            "propertyTypeId": 11,
            "propertyTypeName": "Beachfront",
            "slug": "beachfront",
            "sonucAdet": 129
        },
        {
            "propertyTypeId": 10,
            "propertyTypeName": "Cheap",
            "slug": "cheap",
            "sonucAdet": 63
        },
        {
            "propertyTypeId": 13,
            "propertyTypeName": "Penthouse",
            "slug": "penthouse",
            "sonucAdet": 38
        }
    ],
    "propertyLists": [
        {
            "id": 12884,
            "deliveryDate": null,
            "type": "Apartment, Residence, Investment, Luxury",
            "sehirAdi": "Istanbul",
            "sehirId": 4,
            "sehirUrl": "istanbul",
            "price": 790119,
            "ilceAdi": null,
            "ilceId": 0,
            "ilceUrl": "sisli",
            "slug": "queen-bomonti-ip-054",
            "projectCode": "IP-054",
            "yatakOdasi": 3,
            "banyo": 3,
            "priceExchange": 4,
            "deliveryYear": 2022,
            "deliveryMounth": 1,
            "projeBaslik": "Bridge Between the Past and Future With Bosphorus Views",
            "propertyImage": null,
            "seoDescription": "Property Project in Bomonti, Sisli offers you amazing Boshoporus views. You can reach Besiktas, Taksim, and Nisantasi on foot",
            "shortDescription": null,
            "resimler": "97CAD432-2D7C-4AAF-BB24-4ED5A40A4644, 82A4C47E-359B-4DB2-A9EA-AE3656BEABE1, C1D16278-B21D-45BD-9EB9-8D2FEB62BF1C",
            "projectSalesStatus": "AvailableForSale",
            "propertyTpye_id": null,
            "propertyTpyeListId": null
        },
        {
            "id": 65800,
            "deliveryDate": null,
            "type": "Apartment, Commercial",
            "sehirAdi": "Istanbul",
            "sehirId": 4,
            "sehirUrl": "istanbul",
            "price": 182000,
            "ilceAdi": null,
            "ilceId": 0,
            "ilceUrl": "bahcesehir",
            "slug": "strada-ip-153",
            "projectCode": "IP-153",
            "yatakOdasi": 6,
            "banyo": 3,
            "priceExchange": 1,
            "deliveryYear": 2022,
            "deliveryMounth": 1,
            "projeBaslik": "Luxury Residences With City View in Bahcesehir, Istanbul",
            "propertyImage": null,
            "seoDescription": "Strada (IP-153) project will offer you the Italian lifestyle in Istanbul. Let your life gain meaning with this residential project where comfort and luxury come together.",
            "shortDescription": null,
            "resimler": "8BB44414-392A-49B7-8C71-671EF913A9E0, 742007CB-0B3F-4B90-92C7-4E0F7C56A4EA, BB0F8A2D-0D7D-4302-8998-3FD0F2367F32",
            "projectSalesStatus": "AvailableForSale",
            "propertyTpye_id": null,
            "propertyTpyeListId": null
        },
        {
            "id": 66218,
            "deliveryDate": null,
            "type": "Apartment, Offices, Residence, Luxury",
            "sehirAdi": "Istanbul",
            "sehirId": 4,
            "sehirUrl": "istanbul",
            "price": 950000,
            "ilceAdi": null,
            "ilceId": 0,
            "ilceUrl": "sariyer",
            "slug": "skyland-istanbul-ip-233",
            "projectCode": "IP-233",
            "yatakOdasi": 5,
            "banyo": 3,
            "priceExchange": 1,
            "deliveryYear": 2022,
            "deliveryMounth": 1,
            "projeBaslik": "A Life Like a Dream In Maslak, Istanbul",
            "propertyImage": null,
            "seoDescription": "Skyland offers you A Life Like a Dream In Istanbul located in Maslak is designed in a modern way to suit all life needs.",
            "shortDescription": null,
            "resimler": "5ACB5E93-E94E-4646-82FD-CF6B1204607B, 17939D68-3718-4CB9-9537-7F3513DEE709, 62276220-8DCC-4368-95D0-E1DEC28C3102",
            "projectSalesStatus": "AvailableForSale",
            "propertyTpye_id": null,
            "propertyTpyeListId": null
        },
        {
            "id": 69367,
            "deliveryDate": null,
            "type": "Apartment, Offices, Investment, Commercial",
            "sehirAdi": "Istanbul",
            "sehirId": 4,
            "sehirUrl": "istanbul",
            "price": 590000,
            "ilceAdi": null,
            "ilceId": 0,
            "ilceUrl": "taksim",
            "slug": "taksim-360-ip-266",
            "projectCode": "IP-266",
            "yatakOdasi": 3,
            "banyo": 2,
            "priceExchange": 1,
            "deliveryYear": 2022,
            "deliveryMounth": 1,
            "projeBaslik": "A unique mixture between the past & tne future",
            "propertyImage": null,
            "seoDescription": "The heart of historical Istanbul, Taksim Square Project, is a mixed-use urban renewal development in İstanbul.",
            "shortDescription": null,
            "resimler": "7FE4E5EA-3AD5-493B-9512-C05D65C6B9E5, E548B61F-F0E6-46FB-B4B1-886F6EA2BDFA, 7647ACD2-F7C6-45DC-B4F7-314BD4C55539",
            "projectSalesStatus": "AvailableForSale",
            "propertyTpye_id": null,
            "propertyTpyeListId": null
        }
    ],
    "anasayfaSehirler": [
        {
            "sehirId": 4,
            "sehirAdi": "Istanbul",
            "cover": "365b10ee-53a2-499e-bda6-2a185745f21c",
            "slug": "istanbul",
            "sonucAdet": 347
        },
        {
            "sehirId": 13,
            "sehirAdi": "Alanya",
            "cover": "556a520b-b6c8-456d-9836-f075c8a6ff92",
            "slug": "alanya",
            "sonucAdet": 56
        },
        {
            "sehirId": 9,
            "sehirAdi": "Bursa",
            "cover": "fa69731e-8d15-4dbe-91f8-ba0c8341ae7f",
            "slug": "bursa",
            "sonucAdet": 26
        },
        {
            "sehirId": 6,
            "sehirAdi": "Antalya",
            "cover": "94598581-473b-48c7-9309-e1b50d29c519",
            "slug": "antalya",
            "sonucAdet": 45
        },
        {
            "sehirId": 5,
            "sehirAdi": "Izmir",
            "cover": "08d1b7ff-d21d-4ee6-9cbe-b63d122e3eb4",
            "slug": "izmir",
            "sonucAdet": 1
        },
        {
            "sehirId": 8,
            "sehirAdi": "Bodrum",
            "cover": "cd7e1120-8215-4128-a2de-f942d3e94d4f",
            "slug": "bodrum",
            "sonucAdet": 15
        },
        {
            "sehirId": 10,
            "sehirAdi": "Mersin",
            "cover": "dedf350a-255a-4b1f-930f-c0d7e751e716",
            "slug": "mersin",
            "sonucAdet": 10
        }
    ],
    "advantagePropertyLangTitle": ""
}
